CSI API ETABS v1

# cDStEurocode_3_2005GetOverwrite Method

---

Retrieves the value of a steel design overwrite item

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetOverwrite(
    	string Name,
    	int Item,
    	ref double Value,
    	ref bool ProgDet
    )

    Function GetOverwrite (
    	Name As String,
    	Item As Integer,
    	ByRef Value As Double,
    	ByRef ProgDet As Boolean
    ) As Integer

    Dim instance As cDStEurocode_3_2005
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ProgDet As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetOverwrite(Name,
    	Item, Value, ProgDet)

    int GetOverwrite(
    	String^ Name,
    	int Item,
    	double% Value,
    	bool% ProgDet
    )

    abstract GetOverwrite :
            Name : string *
            Item : int *
            Value : float byref *
            ProgDet : bool byref -> int

#### Parameters

Name

    Type: SystemString
The name of a frame object with a steel frame design procedure

Item

    Type: SystemInt32
This is an integer between 1 and 60, inclusive, indicating the overwrite item
considered.

  1. Framing Type
  2. Consider Deflection
  3. Deflection check type
  4. DL deflection limit, L/Value
  5. SDL + LL deflection limits, L/Value
  6. LL deflection limit, L/Value
  7. Total load deflection limit, L/Value
  8. Total camber limit, L/Value
  9. DL deflection limit, absolute
  10. SDL + LL deflection limit, absolute
  11. LL deflection limit, absolute
  12. Total load deflection limit, absolute
  13. Total camber limit, absolute
  14. Specified camber
  15. Net area to total area ratio
  16. Live load reduction factor
  17. Unbraced length ratio, Ly
  18. Unbraced length ratio, Lz
  19. Effective length factor, K2y
  20. Effective length factor, K2z
  21. Moment coefficient, kyy
  22. Moment coefficient, kzz
  23. Bending coefficient, C1
  24. Effective length factor, K1y
  25. Effective length factor, K1z
  26. Yield stress, Fy
  27. Compressive capacity, Nc,Rd
  28. Tensile capacity, Nt,Rd
  29. Bending capacity Y-Y, Mcy,Rd
  30. Bending capacity Z-Z, Mcz,Rd
  31. Buckling resistance moment, Mb,Rd
  32. Shear capacity Z-Z, Vz,Rd
  33. Shear capacity Y-Y, Vy,Rd
  34. Demand/capacity ratio limit
  35. Section class
  36. Column buckling curve, y-y
  37. Column buckling curve, z-z
  38. Buckling curve for LTB
  39. System overstrength factor, Omega
  40. Is rolled section
  41. Unbraced length ratio, LLTB

  44. Effective length factor, KLTB
  45. Material overstrength, GammaOv

  49. Bending coefficient, C2
  50. Bending coefficient, C3
  51. Warping constant, Iw
  52. Elastic torsional buckling force, Ncr,T
  53. Elastic torsional-flexural buckling force, Ncr,TF
  54. Elastic critical moment for lateral-torsional buckling, Mcr
  55. Moment coefficient, kzy
  56. Moment coefficient, kyz
  57. Warping coefficient, kw
  58. Coordinate of load application, za
  59. Coordinate of shear center, zs
  60. Bending Coefficients C1, C2, C3 Option

Value

    Type: SystemDouble
The numeric value of the considered overwrite item.

  1. Design Section
  2. Framing Type
     * 0 = Program Default
     * 1 = DCH-MRF (Ductility Class High - Moment Frame)
     * 2 = DCM-MRF (Ductility Class Medium - Moment Frame)
     * 3 = DCL-MRF (Ductility Class Low - Moment Frame)
     * 4 = DCH-CBF (Ductility Class High - Concentrically Braced Frame)
     * 5 = DCM-CBF (Ductility Class Medium - Concentrically Braced Frame)
     * 6 = DCL-CBF (Ductility Class Low - Concentrically Braced Frame)
     * 7 = DCH-EBF (Ductility Class High - Eccentrically Braced Frame)
     * 8 = DCM-EBF (Ductility Class Medium - Eccentrically Braced Frame)
     * 9 = DCL-EBF (Ductility Class Low - Eccentrically Braced Frame)
     * 10 = Inverted Pendulum Structure
     * 11 = Secondary
     * 12 = Non Seismic
  3. Consider Deflection
     * 0 = Program Default
     * 1 = No
     * 2 = Yes
  4. Deflection check type
     * 0 = Program Default
     * 1 = Ratio
     * 2 = Absolute
     * 3 = Both
  5. DL deflection limit, L/Value

Value >= 0; 0 means no check for this item.

  6. SDL + LL deflection limits, L/Value

Value >= 0; 0 means no check for this item.

  7. Value >= 0; 0 means no check for this item.

LL deflection limit, L/Value

  8. Total load deflection limit, L/Value

Value >= 0; 0 means no check for this item.

  9. Total camber limit, L/Value

Value >= 0; 0 means no check for this item.

  10. DL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  11. SDL + LL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  12. LL deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  13. Total load deflection limit, absolute

Value >= 0; 0 means no check for this item. [L]

  14. Total camber limit, absolute

Value >= 0; 0 means no check for this item. [L]

  15. Specified camber

Value >= 0; 0 means no check for this item. [L]

  16. Net area to total area ratio

Value >= 0; 0 means use program determined value.

  17. Live load reduction factor

Value >= 0; 0 means use program determined value.

  18. Unbraced length ratio, Ly

Value >= 0; 0 means use program determined value.

  19. Unbraced length ratio, Lz

Value >= 0; 0 means use program determined value.

  20. Effective length factor, K2y

Value >= 0; 0 means use program determined value.

  21. Effective length factor, K2z

Value >= 0; 0 means use program determined value.

  22. Moment coefficient, kyy

Value >= 0; 0 means use program determined value.

  23. Moment coefficient, kzz

Value >= 0; 0 means use program determined value.

  24. Bending coefficient, C1

Value >= 0; 0 means use program determined value.

  25. Effective length factor, K1y

Value >= 0; 0 means use program determined value.

  26. Effective length factor, K1z

Value >= 0; 0 means use program determined value.

  27. Yield stress, Fy

Value >= 0; 0 means use program determined value. [F/L^2]

  28. Compressive capacity, Nc,Rd

Value >= 0; 0 means use program determined value. [F]

  29. Tensile capacity, Nt,Rd

Value >= 0; 0 means use program determined value. [F]

  30. Bending capacity Y-Y, Mcy,Rd

Value >= 0; 0 means use program determined value. [F.L]

  31. Bending capacity Z-Z, Mcz,Rd

Value >= 0; 0 means use program determined value. [F.L]

  32. Buckling resistance moment, Mb,Rd

Value >= 0; 0 means use program determined value. [F.L]

  33. Shear capacity Z-Z, Vz,Rd

Value >= 0; 0 means use program determined value. [F]

  34. Shear capacity Y-Y, Vy,Rd

Value >= 0; 0 means use program determined value. [F]

  35. Demand/capacity ratio limit

Value >= 0; 0 means use program determined value.

  36. Section Class
     * 0 = Program Default
     * 1 = Class 1
     * 2 = Class 2
     * 3 = Class 3
     * 4 = Class 4
  37. Column buckling curve (y-y)
     * 0 = Program Default
     * 1 = a0
     * 2 = a
     * 3 = b
     * 4 = c
     * 5 = d
  38. Column buckling curve (z-z)
     * 0 = Program Default
     * 1 = a0
     * 2 = a
     * 3 = b
     * 4 = c
     * 5 = d
  39. Buckling curve for LTB
     * 0 = Program Default
     * 1 = a0
     * 2 = a
     * 3 = b
     * 4 = c
     * 5 = d
  40. System overstrength factor, Omega

Value >= 0; 0 means use a program determined value.

  41. Is rolled section
     * 0 = Program Default
     * 1 = No
     * 2 = Yes
  42. Unbraced length ratio, LLTB

Value >= 0; 0 means use program determined value.

  44. Effective length factor, KLTB

Value >= 0; 0 means use program determined value.

  45. Material overstrength, GammaOv

Value >= 0; 0 means use program determined value.

  49. Bending coefficient, C2

Value >= 0; 0 means use program determined value.

  50. Bending coefficient, C3

Value >= 0; 0 means use program determined value.

  51. Warping constant, Iw

Value >= 0; 0 means use program determined value.

  52. Elastic torsional buckling force, Ncr,T

Value >= 0; 0 means use program determined value.

  53. Elastic torsional-flexural buckling force, Ncr,TF

Value >= 0; 0 means use program determined value.

  54. Elastic critical moment for lateral-torsional buckling, Mcr

Value >= 0; 0 means use program determined value.

  55. Moment coefficient, kzy

Value >= 0; 0 means use program determined value.

  56. Moment coefficient, kyz

Value >= 0; 0 means use program determined value.

  57. Warping coefficient, kw

Value >= 0; 0 means use program determined value.

  58. Coordinate of load application, za
  59. Coordinate of shear center, zs
  60. Bending Coefficients C1, C2, C3 Option
     * 1 = Method 1 - EC3
     * 2 = Method 2 - General
     * 3 = Method 3 - User Defined

ProgDet

    Type: SystemBoolean
If this item is True, the specified value is program determined.

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("Eurocode 3-2005")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start steel design
       ret = SapModel.DesignSteel.StartDesign

    'get overwrite item
       ret = SapModel.DesignSteel.Eurocode_3_2005.GetOverwrite("8", 2, Value, ProgDet)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStEurocode_3_2005 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com